app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 5]]
---
    <%= link_to post_favorites_path(@post), method: :delete, remote: true do %>
      ♥<%= @post.favorites.count %> Likes

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 5]]
---
    <%= link_to post_favorites_path(@post), method: :post, remote: true do %>
      ♡<%= @post.favorites.count %> Likes