app/views/users/show.html.erb

                <span>Category:
                  <% post.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "post_category_relations" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."post_id" = ?  [["post_id", 5]]