app/views/posts/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "post_category_relations" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."post_id" = ?  [["post_id", 7]]
---
                   <p><h5>Category:</h5>
                      <% post.categories.each do |category| %>

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 7]]
SELECT COUNT(*) FROM "posts"
---
                  <p> <%= attachment_image_tag post.user, :profile_image, :fill, 50, 50, format: 'jpeg', fallback: "no_image.jpg" %></p>
                  <p><%= link_to "#{post.post_comments.count} Comment(s)", post_path(post.id) %></p>