app/views/posts/new.html.erb

SELECT "categories".* FROM "categories"
---
            <%= f.label :category, 'Category', class:"label" %><br>
            <%= f.collection_check_boxes(:category_ids, Category.all, :id, :name) do |category| %>