app/views/posts/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "post_category_relations" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."post_id" = ?  [["post_id", 6]]
---
      <p>Category:
        <% @post.categories.each do |category| %>

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 6]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 7]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 7]]
---
      <div class="comments">
      <h4><span class="bg-light">Comments：<%= @post.post_comments.count %></span></h4>
      <% @post.post_comments.each do |post_comment| %>