app/views/posts/show.html.erb

      <p>Category:
        <% @post.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "post_category_relations" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."post_id" = ?  [["post_id", 6]]

      <div class="comments">
      <h4><span class="bg-light">Comments：<%= @post.post_comments.count %></span></h4>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 5]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 5]]