app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "れい"], ["email", "ri@gmail"], ["message", "れいだよー"], ["created_at", "2021-09-05 07:54:55.837655"], ["updated_at", "2021-09-05 07:54:55.837655"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save