app/controllers/messages_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 5], ["room_id", 2]]
INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 5], ["room_id", 2], ["content", "hello!!!!!!!!"], ["created_at", "2021-09-01 23:22:38.415680"], ["updated_at", "2021-09-01 23:22:38.415680"]]
---
  def create
    if Entry.where(user_id: current_user.id, room_id: params[:message][:room_id]).present?
      @message = Message.create(params.require(:message).permit(:user_id, :content, :room_id).merge(user_id: current_user.id))