app/controllers/post_comments_controller.rb

  def create
    post = Post.find(params[:post_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.post_id = post.id
    comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "nice!!!"], ["user_id", 1], ["post_id", 5], ["created_at", "2021-08-28 10:25:19.221502"], ["updated_at", "2021-08-28 10:25:19.221502"]]