app/controllers/posts_controller.rb

  def update
    post = Post.find(params[:id])
    if params[:post][:image_ids]
      params[:post][:image_ids].each do |image_id|
        image = post.images.find(image_id)
        image.purge
      end
    end
    if post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2021-09-11 06:22:45.155137"], ["id", 7]]