app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "test"], ["user_id", 8], ["created_at", "2021-09-11 05:31:31.183104"], ["updated_at", "2021-09-11 05:31:31.183104"]]

  def index
    # if params[:category_id]
    #   @category = Category.find(params[:category_id])
    #   @posts = @category.posts.page(params[:page]).reverse_order.order(created_at: :desc)
    # else
      @posts = Post.page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def category1
    @category = Category.find(1)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 5], ["OFFSET", 0]]

  def category2
    @category = Category.find(2)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 2], ["LIMIT", 5], ["OFFSET", 0]]

  def category3
    @category = Category.find(3)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 3], ["LIMIT", 5], ["OFFSET", 0]]

  def category4
    @category = Category.find(4)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 4], ["LIMIT", 5], ["OFFSET", 0]]

  def category5
    @category = Category.find(5)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 5], ["LIMIT", 5], ["OFFSET", 0]]

  def category6
    @category = Category.find(6)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 6], ["LIMIT", 5], ["OFFSET", 0]]

  def category7
    @category = Category.find(7)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 7], ["LIMIT", 5], ["OFFSET", 0]]

  def category8
    @category = Category.find(8)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 8], ["LIMIT", 5], ["OFFSET", 0]]

  def category9
    @category = Category.find(9)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 9], ["LIMIT", 5], ["OFFSET", 0]]

  def category10
    @category = Category.find(10)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 10], ["LIMIT", 5], ["OFFSET", 0]]

  def category11
    @category = Category.find(11)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 11], ["LIMIT", 5], ["OFFSET", 0]]

  def category12
    @category = Category.find(12)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 12], ["LIMIT", 5], ["OFFSET", 0]]

  def category13
    @category = Category.find(13)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 13], ["LIMIT", 5], ["OFFSET", 0]]

  def category14
    @category = Category.find(14)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 14], ["LIMIT", 5], ["OFFSET", 0]]

  def category15
    @category = Category.find(15)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 15], ["LIMIT", 5], ["OFFSET", 0]]

  def category16
    @category = Category.find(16)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 16], ["LIMIT", 5], ["OFFSET", 0]]

  def category17
    @category = Category.find(17)
    @post = Post.includes(:categories).where(post_category_relations: { category_id: @category }).page(params[:page]).reverse_order.order(created_at: :desc)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  DISTINCT "posts"."id" FROM "posts" LEFT OUTER JOIN "post_category_relations" ON "post_category_relations"."post_id" = "posts"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "post_category_relations"."category_id" WHERE "post_category_relations"."category_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 17], ["LIMIT", 5], ["OFFSET", 0]]

  def category
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]