app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "Hello!"], ["profile_image_id", "796e29e958d51c68de6d47a59a75a75e321b18f50513e9296d65f7f0c243"], ["updated_at", "2021-08-11 00:07:31.895199"], ["id", 1]]