app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."id" DESC, "posts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 4]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 11]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 5]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.page(params[:page]).reverse_order.order(created_at: :desc)
    # @post = Post.find(params[:id])


    # DM用
    @currentUserEntry=Entry.where(user_id: current_user.id)
    @userEntry=Entry.where(user_id: @user.id)
    unless @user.id == current_user.id
      @currentUserEntry.each do |cu|

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "HEllo."], ["profile_image_id", nil], ["updated_at", "2021-09-10 00:19:02.956239"], ["id", 4]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @user = User.find(params[:id])
    if @user == current_user
      @user.destroy