app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @posts = @user.posts.page(params[:page]).reverse_order.order(created_at: :desc)
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]