app/models/user.rb

INSERT INTO "relationships" ("created_at", "updated_at", "follower_id", "followed_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-08-31 09:48:28.964107"], ["updated_at", "2021-08-31 09:48:28.964107"], ["follower_id", 1], ["followed_id", 2]]
---
  def follow(user_id)
    relationships.create(followed_id: user_id)